{
  "profile": "This tutorial is designed to aid in the developing process by highlighting the available features that detail activation information. It reviews several commands that enrich the Cloud Shell experience by easing routine debugging.",
  "time": "10 minutes",
  "skills": ["Debugging"],
  "steps": [
    {
      "heading": "Introduction",
      "content": "In this tutorial, we will review the basic commands and capabilities that Shell provides in order to aid in the  process of debugging compositions. Upon completion, you will be familiar with various techniques that can be used for evaluating activations.",
      "transition": "next"
    },
    {
      "heading": "Session List",
      "content": "As has been imported to the command line, the `session list` command is used to view a list of all recent composition activations, or sessions. To view your recent sessions, click enter.",
      "transition": "enter",
      "autocomplete": {
        "value": "session list"
      },
      "extras": {
        "tips": [
          "Tip: Session details can also be viewed using `session get sessionId`, where 'sessionId' is the id of the session."
        ]
      }
    },
    {
      "heading": "Summary View",
      "content": "More statistical details about each session can be seen using the `summary` command, as imported on the command line. Additionally, this view can be brought up by clicking the small list icon at the bottom of the session list.",
      "transition": "next",
      "autocomplete": {
        "value": "summary"
      },
      "extras": {
        "tips": [
          "Tip: In order to filter the activations by latency, click the small thermometer icons on the bottom righthand side of the sidecar toolbar."
        ]
      }
    },
    {
      "heading": "Grid View",
      "content": "The `grid` command is designed show a large number of activations and their results at once. Press enter to view the activation activity of your recent application tests. In addition to the command, the grid icon on the bottom lefthand side of the session list can be clicked to show grid view.",
      "transition": "next",
      "autocomplete": {
        "value": "grid"
      },
      "extras": {
        "tips": [
          "Tip: The 'Summary' and 'Grid' buttons on the bottom lefthand side of the sidecar toolbar can be used to toggle between grid view and summary.",
          "Tip: A timeline view of all activations can be viewed by clicking the small bargraph icon on the bottom rightnand side of the sidecar toolbar."
        ]
      }
    },
    {
      "heading": "Logs",
      "content": "In order to view the logs ",
      "transition": "next",
      "extras": {
        "commands": ["`logs sessionID`"]
      }
    },
    {
      "heading": "The Debug Command",
      "content": "Additionally, Cloud Shell offers the `debug` commands to debug an action using the javascript developer console.",
      "transition": "next",
      "extras": {
        "commands": "`debug actionName`: Debug `actionName`"
      }
    },
    {
      "heading": "Localized Invocation",
      "content": "In certain cases, you may want to invoke an action locally rather than in the Cloud in order to access certain diagnostics. This can be done by specifying `local` with the `invoke` command. -> No debugger",
      "transition": "next",
      "extras": {
        "commands": "`local invoke actionName`: Invoke `actionName` locally."
      }
    },
    {
      "heading": "Conclusion",
      "content": "You have completed the \"Debugging\" Tutorial. Click CLOSE to exit hte tutorial or back to return to the previous page. Enjoy your experience with IBM Cloud Shell!"
    }
  ]
}
